app/Controllers/Auth.php

    public function prosesLogin()
    {
        $model = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username',$username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1

    public function profil()
    {
        if (!session()->get('login')) {
            return redirect()->to('/');
        }

        $model = new UserModel();
        $username = session()->get('username');
        $data['user'] = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1