app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `obat`
SELECT COUNT(*) AS `numrows`
FROM `obat`
WHERE `stok` <= stok_minimum
SELECT SUM(`stok`) AS `stok`
FROM `obat`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `obat`
WHERE `expired_date` IS NOT NULL
AND `expired_date` <= '2026-06-25'
---
    public function index()
    {
        $obatModel = new ObatModel();

        $data['jumlahObat'] = $obatModel->countAll();

        $data['stokMenipis'] = $obatModel
            ->where('stok <= stok_minimum')
            ->countAllResults();

        $stok = $obatModel
            ->selectSum('stok')
            ->first();

        $data['totalStok'] = $stok['stok'] ?? 0;

        $data['totalExpired'] = $obatModel
            ->where('expired_date IS NOT NULL')
            ->where('expired_date <=', date('Y-m-d'))
            ->countAllResults();

SELECT *
FROM `obat`
WHERE `expired_date` IS NOT NULL
AND `expired_date` <= '2026-06-26'
ORDER BY `expired_date` ASC
---
    public function getNotifications()
    {
        if (!session()->get('login')) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Unauthorized'])->setStatusCode(401);
        }

        $obatModel = new ObatModel();
        $expiredObat = $obatModel
            ->where('expired_date IS NOT NULL')
            ->where('expired_date <=', date('Y-m-d'))
            ->orderBy('expired_date', 'ASC')
            ->findAll();