app/Controllers/Expired.php

    public function index()
    {
        $model = new ObatModel();

        $startDate = $this->request->getGet('start_date');
        $endDate = $this->request->getGet('end_date');

        $query = $model->where('expired_date IS NOT NULL');

        if ($startDate && $endDate) {
            $query = $query->where('expired_date >=', $startDate)
                           ->where('expired_date <=', $endDate);
        } else {
            // Default: Tampilkan semua yang sudah kedaluwarsa hari ini ke belakang
            $query = $query->where('expired_date <=', date('Y-m-d'));
        }

        $data['obat'] = $query->orderBy('expired_date', 'ASC')->paginate(15, 'expired');
---
SELECT *
FROM `obat`
WHERE `expired_date` IS NOT NULL
AND `expired_date` <= '2026-06-26'
ORDER BY `expired_date` ASC
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `obat`
WHERE `expired_date` IS NOT NULL
AND `expired_date` <= '2026-06-26'