app/Controllers/Fefo.php

    public function index()
    {
        $model = new ObatModel();

        $data['obat'] = $model
            ->where('expired_date IS NOT NULL')
            ->orderBy('expired_date', 'ASC')
            ->findAll();
---
SELECT *
FROM `obat`
WHERE `expired_date` IS NOT NULL
ORDER BY `expired_date` ASC