app/Controllers/Laporan.php

SELECT *
FROM `obat`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `obat`
---
    public function index()
    {
        $model = new ObatModel();

        $data['obat'] = $model->paginate(10, 'laporan');