app/Controllers/LogActivity.php

SELECT *
FROM `log_activity`
ORDER BY `id` DESC
 LIMIT 25
SELECT COUNT(*) AS `numrows`
FROM `log_activity`
---
    public function index()
    {
        // Batasi akses hanya untuk Admin
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/dashboard');
        }

        $model = new LogActivityModel();

        $data['logs'] = $model->orderBy('id', 'DESC')->paginate(25, 'logs');