app/Controllers/Obat.php

    public function index()
    {
        $model = new ObatModel();

        $keyword = $this->request->getGet('keyword');

        if ($keyword) {

            $data['obat'] = $model
                ->like('nama_obat', $keyword)
                ->paginate(10, 'obat');

        } else {

            $data['obat'] = $model
                ->paginate(10, 'obat');
---
SELECT *
FROM `obat`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `obat`

    public function edit($id)
    {
        $model = new ObatModel();

        $data['obat'] = $model->find($id);
---
SELECT *
FROM `obat`
WHERE `obat`.`id` = '7'