app/Controllers/Pengguna.php

SELECT *
FROM `users`
---
    public function index()
    {
        $redirect = $this->cekAdmin();
        if ($redirect) return $redirect;

        $model = new UserModel();
        $keyword = $this->request->getGet('keyword');

        if ($keyword) {
            $data['users'] = $model->like('nama', $keyword)
                ->orLike('username', $keyword)
                ->findAll();
        } else {
            $data['users'] = $model->findAll();