app/Controllers/StokOpname.php

SELECT *
FROM `obat`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `obat`
SELECT *
FROM `stok_opname`
WHERE `obat_id` = '4'
ORDER BY `id` DESC
 LIMIT 1
---
    public function index()
    {
        $obatModel = new ObatModel();
        $opnameModel = new StokOpnameModel();

        $obat = $obatModel->paginate(10, 'stokopname');

        foreach ($obat as &$o) {

            $hasil = $opnameModel
                ->where('obat_id', $o['id'])
                ->orderBy('id', 'DESC')
                ->first();